// 1)დაწერეთ JavaScript-ის პროგრამა რომელიც დაითვლის სიაში ელემენტების რაოდენობას, შედეგი გამოიტანეთ კონსოლში

let name = ["GIORGI",    "NIKOLOZI",  "ANDREA", "SOFO", "TAZO ","MARIAMI", "ANGELA", "KONSTANTINE"]

console.log(name.length)


// 2)for-ციკლის გამოყენებით იპოვეთ სიაში ყველაზე დიდი და ყველაზე პატარა რიცხვები ?

const numbers = [3, 7, 1, 9, 12, -5, 4, 8]





// 3)შექმენით სია, ამ სიაში შეინახეთ String-ტიპის მონაცემები და for-ციკლის გამოყენებით ახალ სიაში დაამატეთ ძველი სიიდან ყოველი სიტყვის პირველი ასო

let name1 = ["lika", "mikaeli","temo"]
let name2= []



for( let  i = 0; i < name1.length; i++ ){
    name2.push(name1[0]); 
}


console.log(name2)


// 4)შექმენით სია სადაც იქნება user-ების სახელი და გვარი და ახალ სიაში დაამატეთ ამ იუსერების  ინიციალები სახელის და გვარის პირველი ასოები, მაგალითად: გიორგი ბიბილაშვილი -> გ.ბ?





// 5)Splice მეთოდის გამოყენებით ჩაანაცვლეთ სიაში ყველა უარყოფითი რიცხვი 0 - ით


const numbers2 = [3, -7, 1, -9, 12, -5, 4, 8];

for (let i = 0; i < numbers2.length; i++) {
    if (numbers2 < 0) {
        numbers2.splice(i, 1, 0); 
    }
}

console.log(numbers2);

// 6)შექმენით სია შეიყვანეთ user-ების სახელი და გვარი თუ user-ების სახელი და გვრი იწყება პატარა ასოთი slice-მეთოდის გამოყენებით ამოშალეთ ასეთი სახელები და გვარები სიიდან?


const users = ["გიორგი ბიბილაშვილი", "ანა კალანდაძე", "ნიკა მახარაძე", "ლუკა აბაშიძე"];


for(let i = 0;i< users.length; i++){

}


