age=[ 15,15,16,16,16,16,16,16,15,17,17,17,17,19,21,21,23,25,25,26,32 ]


avg_age = sum(age) / len(age)

print(age.count(16))




name =["გიორგი","ანანო","სოფო","ვანო","თაზო" ]
name1="გიორგი"

count=0
for i in name :
    if i == name1:
        count +=1
print(count)

print(name.count(name1))

number=[12,14,13,15,16,17,18,19]
number1=[]
for i in number:
    if i % 2 ==0:
        number1.append(i)

print(number1)

number=[12,14,13,15,16,17,18,19]
for i in number:
    if i % 2==0:
        number.remove(i)

print(number)

names = ["tiko" , "giorgi", "tinatini" , "tako" , "lasha", "toko", "beqa"]
name4=[]
for i in names:
    if i[0]=="t":
        name4.append(i)
        
print(name4)

# 2)  შექმენით პროგრამა რომელიც დაითვლის სიაში რამდენჯერ მეორდება თქვენი სახელი არ გამოიყენოთ count ფუნქცია 
# 3)  შექმენით პროგრამა რომელიც დაითვლის სიაში რამდენჯერ მეორდება თქვენი სახელი გამოიყენეთ count ფუნქცია
# 4) შექმენით სია რომელშიც იქნება რენდომ რიცხვები მოთავსებული შემდეგ კი შექმენით მეორე სია რომელშიც გადაიტანთ პირველი სიიდან მხოლოდ ლუწ რიცხვებს
# 5) შექმენით სია რომელშიც იქნება მოთავსებული რენდომ რიცხვები შემდეგ კი ამ სიიდან ამოშალეთ ყველა ლუწი რიცხვი
# 6) შექმენით სია რომელშიც იქნება სახელები შემდეგ კი შექმენით პროგრამა რომელიც ამოშლის ყველა სახელს რომელიც "t" ასოზე იწყება და ჩაამატებს ახალ სიაში
