// 1) მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი დაითვალეთ ერთიდან მომხმარებლსი შემოტანილ რიცხვამდე მხოლოდ ლუწი რიცხვების ჯამი, გამოიყენეთ for

let Input = Number(prompt("enter number:"));
let sum = 0;

for (let i = 0; i <= Input; i++) {
    if (i % 2 == 0) {
        sum += i;
    }
}
    console.log(sum)


 // შექმენით სია სადაც იქნება 10 რენდომ რიცხვი, შემდეგ კი დაითვალეთ ამ სიის რიცხვების ჯამი for loop ის გამოყენებით

 let number = [20,22,33,44,55,6,7,88,11,21]

 let sum2 = 0;

 for(let i = 0; i<= number.length;  i++){
    sum2 += i
 }
console.log(sum2)

// 3) შექმენით რიცხვებით სავსე სია, შემდეგ მიწვდით თითოეულ ელემენტს და დააჯამეთ მხოლოდ ლუწი რიცხვები აყვანილი კვადრატში ამ სიიდან

let num =[23,42,2,12,44,55,64,35,636,36,32,131,324,5,]

let sum3 =0

for(let i of num){
    if(i%2==0){
        sum3 +=i**2
    }
}
console.log(sum3)