# 1) შექმენით სია რომელშიც გექნებათ 1 დან 20-მდე რიცხვები დაბეჭდეთ თითოეული სიის ელემენტი და თითოეულ მათგანს მიუწერეთ ლუწია თუ კენტი
numbers = list(range(1, 21))
for number in numbers:
    if number % 2 == 0:
        print(f"{number}")
    else:
        print(f"{number}")

print()  

# 2) შექმენით სია რომელშიც გექნებათ 1 დან 20მდე რიცხვები შემდეგ კი დაბეჭდეთ 3 ის ჯერადი რიცხვები
for number in numbers:
    if number % 3 == 0:
        print(number)

print()  

# 3) შექმენით სია რომელშიც გექნებათ ათიცალი სხვადასხვა რიცხვი შემდეგ კი დაბეჭდეთ ამ სიიდან მხოლოდ 10ზე დაბალი რიცხვები
different_numbers = [5, 12, 3, 8, 15, 1, 9, 20, 7, 4]
for number in different_numbers:
    if number < 10:
        print(number)

print()  

# 4) შექმენით სია რომელშიც გექნებათ ოცი სხვადასხვა რიცხვი შემდეგ კი დაბეჭდეთ მხოლოდ 10-ზე ნაკლები და მხოლოდ ლუწი რიცხვები
twenty_numbers = [2, 15, 4, 9, 12, 6, 1, 18, 3, 10, 7, 14, 8, 5, 11, 20, 13, 17, 16, 19]
for number in twenty_numbers:
    if number < 10 and number % 2 == 0:
        print(number)

print()  

# 5) შექმენით სია რომელშიც გექნებათ ოცი სხვადასხვა რიცხვი შემდეგ კი დაბეჭდეთ მხოლოდ 20 ზე მეტი რიცხვები ისე რომ იყოს თან სამის ჯერადი
for number in twenty_numbers:
    if number > 20 and number % 3 == 0:
        print(number)

print()  

# 6) შექმენით სია სადაც მოათავსებთ ხუთ სხვადასხვა სახელს შემდეგ კი მიწვდით თითოეულ ელემენტს(სახელს) და დაბეჭდეთ თითოეულში ასოების რაოდენობა
names = ["ანა", "გიორგი", "მარიამი", "დავით", "ნინო"]
for name in names:
    print(f"{name} {len(name)} ")

print() 

# 7) შექმენით სია სადაც მოათავსებთ ხუთ სხვადასხვა სახელს შემდეგ კი დაბეჭდეთ ამ სიაში თითოეული ელემენტის პირველი ასო
for name in names:
    print(name[0])